ledgers-deposit-account/ledgers-deposit-account-service-impl/src/test/resources/de/adorsys/ledgers/deposit/api/service/impl/PaymentTargetDetailsBatch.yml

transactionId: TR_1
endToEndId: 123456788, 123456789
bookingDate: 2018-12-12
valueDate: 2018-12-12
debtorName:
debtorAccount:
  {
    iban: DE91100000000123456789,
    bban: bban,
    pan: pan,
    maskedPan: maskedPan,
    msisdn: msisdn,
    currency: EUR
  }
ultimateDebtor:
paymentOrderId: orderId
paymentType: BULK
transactionAmount:
  {
   currency: EUR,
   amount: 200
  }
creditorAccount:
creditorAgent: multiple
creditorName: multiple
creditorAddress:
ultimateCreditor:
remittanceInformationUnstructured: Batch booking, no remittance information available
paymentProduct: sepa-credit-transfers
transactionStatus: RCVD
exchangeRate:
bankTransactionCode: PMNT-ICDT-STDO
proprietaryBankTransactionCode: PMNT-ICDT-STDO
